# Pandas

In [1]:
import pandas as pd
df=pd.read_csv('new_data.csv', index_col='sn')
df

     name  age    address
sn
1     Ram   45  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   32   Lalitpur
4   Nabin   77      Jhapa
5    Hari   23    Chitwan
6   Akash   33  Kathmandu

In [2]:
import pandas as pd
df=pd.read_csv('new_data.csv', nrows=4)
df

   sn   name  age    address
0   1    Ram   45  Kathmandu
1   2  Shyam   56  Bhaktapur
2   3   Hari   32   Lalitpur
3   4  Nabin   77      Jhapa

In [3]:
df.head(4)

   sn   name  age    address
0   1    Ram   45  Kathmandu
1   2  Shyam   56  Bhaktapur
2   3   Hari   32   Lalitpur
3   4  Nabin   77      Jhapa

In [4]:
df.tail(3)

   sn   name  age    address
1   2  Shyam   56  Bhaktapur
2   3   Hari   32   Lalitpur
3   4  Nabin   77      Jhapa

In [5]:
import pandas as pd
df=pd.read_csv('new_data.csv', index_col='sn')
df

     name  age    address
sn
1     Ram   45  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   32   Lalitpur
4   Nabin   77      Jhapa
5    Hari   23    Chitwan
6   Akash   33  Kathmandu

In [6]:
import pandas as pd
df=pd.read_csv('new_data.csv', index_col='sn', usecols=['sn','name','address'])
df

     name    address
sn
1     Ram  Kathmandu
2   Shyam  Bhaktapur
3    Hari   Lalitpur
4   Nabin      Jhapa
5    Hari    Chitwan
6   Akash  Kathmandu

In [7]:
import pandas as pd
df=pd.read_csv('new_data.csv', index_col='sn')
df

     name  age    address
sn
1     Ram   45  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   32   Lalitpur
4   Nabin   77      Jhapa
5    Hari   23    Chitwan
6   Akash   33  Kathmandu

In [8]:
#ilic -> index localizer
df.iloc[1:5]

     name  age    address
sn
2   Shyam   56  Bhaktapur
3    Hari   32   Lalitpur
4   Nabin   77      Jhapa
5    Hari   23    Chitwan

In [9]:
df.iloc[1:5,0:2]

     name  age
sn
2   Shyam   56
3    Hari   32
4   Nabin   77
5    Hari   23

In [10]:
#loc
df.loc[1:5]

     name  age    address
sn
1     Ram   45  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   32   Lalitpur
4   Nabin   77      Jhapa
5    Hari   23    Chitwan

In [11]:
df['name']=='Hari'

sn
1    False
2    False
3     True
4    False
5     True
6    False
Name: name, dtype: bool

In [20]:
#condition
df[(df['name']=='Hari')]

    name  age   address
sn
3   Hari   32  Lalitpur
5   Hari   23   Chitwan

In [21]:
df[(df['address']=='Kathmandu') | (df['age']<50) ]

     name  age    address
sn
1     Ram   45  Kathmandu
3    Hari   32   Lalitpur
5    Hari   23    Chitwan
6   Akash   33  Kathmandu

In [23]:
df

     name  age    address
sn
1     Ram   45  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   32   Lalitpur
4   Nabin   77      Jhapa
5    Hari   23    Chitwan
6   Akash   33  Kathmandu

In [25]:
df[(df['age']>40) & (df['address']!='Kathmandu')]

     name  age    address
sn
2   Shyam   56  Bhaktapur
4   Nabin   77      Jhapa

In [26]:
df.values

array([['Ram', 45, 'Kathmandu'],
       ['Shyam', 56, 'Bhaktapur'],
       ['Hari', 32, 'Lalitpur'],
       ['Nabin', 77, 'Jhapa'],
       ['Hari', 23, 'Chitwan'],
       ['Akash', 33, 'Kathmandu']], dtype=object)

In [27]:
df.items

<bound method DataFrame.items of      name  age    address
sn
1     Ram   45  Kathmandu
2   Shyam   56  Bhaktapur
3    Hari   32   Lalitpur
4   Nabin   77      Jhapa
5    Hari   23    Chitwan
6   Akash   33  Kathmandu>

In [32]:
list(df.columns)

['name', 'age', 'address']

In [28]:
df.columns

Index(['name', 'age', 'address'], dtype='object')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 1 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     6 non-null      object
 1   age      6 non-null      int64
 2   address  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 364.0+ bytes

In [37]:
#Data Entry into csv file using list inside dict
import pandas as pd
data={'name':['Ram','Shyam','Hari'],
     'age':[23,56,11],
     'address':['Kathmandu','Lalitpur','Bhaktapur']}
df=pd.DataFrame(data)
df.to_csv('info.csv')
df

    name  age    address
0    Ram   23  Kathmandu
1  Shyam   56   Lalitpur
2   Hari   11  Bhaktapur

In [48]:
df=pd.read_csv('info.csv', index_col='sn')
df

     name  age    address
sn
0     Ram   23  Kathmandu
1   Shyam   56   Lalitpur
2    Hari   11  Bhaktapur

In [47]:
#Data Entry into csv file using list inside dict
import pandas as pd
data={'name':['Ram','Shyam','Hari'],
     'age':[23,56,11],
     'address':['Kathmandu','Lalitpur','Bhaktapur']}
df=pd.DataFrame(data)
df.to_json('info.json')
df

    name  age    address
0    Ram   23  Kathmandu
1  Shyam   56   Lalitpur
2   Hari   11  Bhaktapur

In [50]:
df=pd.read_json('info.json')
df

    name  age    address
0    Ram   23  Kathmandu
1  Shyam   56   Lalitpur
2   Hari   11  Bhaktapur

In [51]:
#Writing for list inside list
import csv
data=[['Name','age','address'],
     ['Ram',34,'Kathmandu'],
     ['Shyam',44,'Lalitpur'],#
     ['Hari',34,'Bhaktapur']]
file=open('data.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [53]:
#Dict Reader
import csv
list_data=[]
file=open('data.csv','r')#r is the default mode
reader=csv.DictReader(file)
for i in reader:
    print(i)
    list_data.append(i)
list_data

{'Name': 'Ram', 'age': '34', 'address': 'Kathmandu'}
{'Name': 'Shyam', 'age': '44', 'address': 'Lalitpur'}
{'Name': 'Hari', 'age': '34', 'address': 'Bhaktapur'}

[{'Name': 'Ram', 'age': '34', 'address': 'Kathmandu'},
 {'Name': 'Shyam', 'age': '44', 'address': 'Lalitpur'},
 {'Name': 'Hari', 'age': '34', 'address': 'Bhaktapur'}]

In [57]:
#Dict Writer
csv_columns=['Name','age','Address']
data=[{'Name':'Ram','age':'16','Address':'Kathmandu'},
      {'Name':'Hari','age':'86','Address':'Lalitpur'}
     ]
csvfile=open('data.csv','a')
writer=csv.DictWriter(csvfile,fieldnames=csv_columns)

writer.writeheader()
writer.writerows(data)
csvfile.close()

In [60]:
#Concatination 
import pandas as pd

df1=pd.DataFrame({'name':['Ram','Shyam','Hari'],
     'age':[23,56,11],
     'address':['Kathmandu','Lalitpur','Bhaktapur']})
df2=pd.DataFrame({'name':['Ram','Shyam','Hari'],
     'age':[23,56,11],
     'address':['Kathmandu','Lalitpur','Bhaktapur']})
df=pd.concat([df1,df2]).reset_index()
df

   index   name  age    address
0      0    Ram   23  Kathmandu
1      1  Shyam   56   Lalitpur
2      2   Hari   11  Bhaktapur
3      0    Ram   23  Kathmandu
4      1  Shyam   56   Lalitpur
5      2   Hari   11  Bhaktapur